---
kind: other
id: Methods.T:Autodesk.Revit.DB.TransactWithCentralOptions
source: html/c64aa261-7b1b-8613-9c08-8b7f539ee044.htm
---
# TransactWithCentralOptions Methods

Gets the callback object that changes Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model.